#=================C. 512 고정 X 의도대로 그러나 최대 512  ================
data_aug_scales = [320, 352, 384, 416, 448, 480, 512]
data_aug_max_size = 512
#=================C. 512 고정 X 의도대로 그러나 최대 512  ================


#=================B. 512 고정 X 의도대로 512이상 허용 ================
#data_aug_scales = [480, 512, 544, 576, 608, 640, 672, 704, 736, 768, 800]
#data_aug_max_size = 1333
#=================B. 512 고정 X 의도대로 512이상 허용 ================

#=================A.그냥 512 고정 의도 안씀 ================
#data_aug_scales = [512]
#data_aug_max_size = 512
#=================A.그냥 512 고정 의도 안씀 ================



#=================C. 512 고정 X 의도대로 그러나 최대 512  ================
data_aug_scales2_resize = [256, 320, 400] 
data_aug_scales2_crop = [256, 400]
#=================C. 512 고정 X 의도대로 그러나 최대 512  ================

#=================B. 512 고정 X 의도대로  512이상 허용================
#data_aug_scales2_resize = [400, 500, 600]
#data_aug_scales2_crop = [384, 600]
#=================B. 512 고정 X 의도대로 512이상 허용 ================

#=================A.그냥 512 고정 의도 안씀 ================
#data_aug_scales2_resize = []
#data_aug_scales2_crop = []
#=================A.그냥 512 고정 의도 안씀 ================


data_aug_scale_overlap = None

